MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX564F128L.atdf
      <value-group caption="In-Circuit Emulator/Debugger Communication Channel Select bits" name="DEVCFG0__ICESEL">
         <value caption="ICE EMUC1/EMUD1 pins shared with PGC1/PGD1" name="ICS_PGx1" value="0x0" />
         <value caption="ICE EMUC2/EMUD2 pins shared with PGC2/PGD2" name="ICS_PGx2" value="0x1" />
      </value-group>
      <value-group caption="Program Flash Write-Protect bits" name="DEVCFG0__PWP">
         <value caption="Disable" name="OFF" value="0xff" />
         <value caption="First 4K" name="PWP4K" value="0xfe" />
         <value caption="First 8K" name="PWP8K" value="0xfd" />
         <value caption="First 12K" name="PWP12K" value="0xfc" />
         <value caption="First 16K" name="PWP16K" value="0xfb" />
         <value caption="First 20K" name="PWP20K" value="0xfa" />
         <value caption="First 24K" name="PWP24K" value="0xf9" />
         <value caption="First 28K" name="PWP28K" value="0xf8" />
         <value caption="First 32K" name="PWP32K" value="0xf7" />
         <value caption="First 36K" name="PWP36K" value="0xf6" />
         <value caption="First 40K" name="PWP40K" value="0xf5" />
         <value caption="First 44K" name="PWP44K" value="0xf4" />
         <value caption="First 48K" name="PWP48K" value="0xf3" />
         <value caption="First 52K" name="PWP52K" value="0xf2" />
         <value caption="First 56K" name="PWP56K" value="0xf1" />
         <value caption="First 60K" name="PWP60K" value="0xf0" />
         <value caption="First 64K" name="PWP64K" value="0xef" />
         <value caption="First 68K" name="PWP68K" value="0xee" />
         <value caption="First 72K" name="PWP72K" value="0xed" />
         <value caption="First 76K" name="PWP76K" value="0xec" />
         <value caption="First 80K" name="PWP80K" value="0xeb" />
         <value caption="First 84K" name="PWP84K" value="0xea" />
         <value caption="First 88K" name="PWP88K" value="0xe9" />
         <value caption="First 92K" name="PWP92K" value="0xe8" />
         <value caption="First 96K" name="PWP96K" value="0xe7" />
         <value caption="First 100K" name="PWP100K" value="0xe6" />
         <value caption="First 104K" name="PWP104K" value="0xe5" />
         <value caption="First 108K" name="PWP108K" value="0xe4" />
         <value caption="First 112K" name="PWP112K" value="0xe3" />
         <value caption="First 116K" name="PWP116K" value="0xe2" />
         <value caption="First 120K" name="PWP120K" value="0xe1" />
         <value caption="First 124K" name="PWP124K" value="0xe0" />
         <value caption="First 128K" name="PWP128K" value="0xdf" />
         <value caption="First 132K" name="PWP132K" value="0xde" />
         <value caption="First 136K" name="PWP136K" value="0xdd" />
         <value caption="First 140K" name="PWP140K" value="0xdc" />
         <value caption="First 144K" name="PWP144K" value="0xdb" />
         <value caption="First 148K" name="PWP148K" value="0xda" />
         <value caption="First 152K" name="PWP152K" value="0xd9" />
         <value caption="First 156K" name="PWP156K" value="0xd8" />
         <value caption="First 160K" name="PWP160K" value="0xd7" />
         <value caption="First 164K" name="PWP164K" value="0xd6" />
         <value caption="First 168K" name="PWP168K" value="0xd5" />
         <value caption="First 172K" name="PWP172K" value="0xd4" />
         <value caption="First 176K" name="PWP176K" value="0xd3" />
         <value caption="First 180K" name="PWP180K" value="0xd2" />
         <value caption="First 184K" name="PWP184K" value="0xd1" />
         <value caption="First 188K" name="PWP188K" value="0xd0" />
         <value caption="First 192K" name="PWP192K" value="0xcf" />
         <value caption="First 196K" name="PWP196K" value="0xce" />
         <value caption="First 200K" name="PWP200K" value="0xcd" />
         <value caption="First 204K" name="PWP204K" value="0xcc" />
         <value caption="First 208K" name="PWP208K" value="0xcb" />
         <value caption="First 212K" name="PWP212K" value="0xca" />
         <value caption="First 216K" name="PWP216K" value="0xc9" />
         <value caption="First 220K" name="PWP220K" value="0xc8" />
         <value caption="First 224K" name="PWP224K" value="0xc7" />
         <value caption="First 228K" name="PWP228K" value="0xc6" />
         <value caption="First 232K" name="PWP232K" value="0xc5" />
         <value caption="First 236K" name="PWP236K" value="0xc4" />
         <value caption="First 240K" name="PWP240K" value="0xc3" />
         <value caption="First 244K" name="PWP244K" value="0xc2" />
         <value caption="First 248K" name="PWP248K" value="0xc1" />
         <value caption="First 252K" name="PWP252K" value="0xc0" />
         <value caption="First 256K" name="PWP256K" value="0xbf" />
         <value caption="First 260K" name="PWP260K" value="0xbe" />
         <value caption="First 264K" name="PWP264K" value="0xbd" />
         <value caption="First 268K" name="PWP268K" value="0xbc" />
         <value caption="First 272K" name="PWP272K" value="0xbb" />
         <value caption="First 276K" name="PWP276K" value="0xba" />
         <value caption="First 280K" name="PWP280K" value="0xb9" />
         <value caption="First 284K" name="PWP284K" value="0xb8" />
         <value caption="First 288K" name="PWP288K" value="0xb7" />
         <value caption="First 292K" name="PWP292K" value="0xb6" />
         <value caption="First 296K" name="PWP296K" value="0xb5" />
         <value caption="First 300K" name="PWP300K" value="0xb4" />
         <value caption="First 304K" name="PWP304K" value="0xb3" />
         <value caption="First 308K" name="PWP308K" value="0xb2" />
         <value caption="First 312K" name="PWP312K" value="0xb1" />
         <value caption="First 316K" name="PWP316K" value="0xb0" />
         <value caption="First 320K" name="PWP320K" value="0xaf" />
         <value caption="First 324K" name="PWP324K" value="0xae" />
         <value caption="First 328K" name="PWP328K" value="0xad" />
         <value caption="First 332K" name="PWP332K" value="0xac" />
         <value caption="First 336K" name="PWP336K" value="0xab" />
         <value caption="First 340K" name="PWP340K" value="0xaa" />
         <value caption="First 344K" name="PWP344K" value="0xa9" />
         <value caption="First 348K" name="PWP348K" value="0xa8" />
         <value caption="First 352K" name="PWP352K" value="0xa7" />
         <value caption="First 356K" name="PWP356K" value="0xa6" />
         <value caption="First 360K" name="PWP360K" value="0xa5" />
         <value caption="First 364K" name="PWP364K" value="0xa4" />
         <value caption="First 368K" name="PWP368K" value="0xa3" />
         <value caption="First 372K" name="PWP372K" value="0xa2" />
         <value caption="First 376K" name="PWP376K" value="0xa1" />
         <value caption="First 380K" name="PWP380K" value="0xa0" />
         <value caption="First 384K" name="PWP384K" value="0x9f" />
         <value caption="First 388K" name="PWP388K" value="0x9e" />
         <value caption="First 392K" name="PWP392K" value="0x9d" />
         <value caption="First 396K" name="PWP396K" value="0x9c" />
         <value caption="First 400K" name="PWP400K" value="0x9b" />
         <value caption="First 404K" name="PWP404K" value="0x9a" />
         <value caption="First 408K" name="PWP408K" value="0x99" />
         <value caption="First 412K" name="PWP412K" value="0x98" />
         <value caption="First 416K" name="PWP416K" value="0x97" />
         <value caption="First 420K" name="PWP420K" value="0x96" />
         <value caption="First 424K" name="PWP424K" value="0x95" />
         <value caption="First 428K" name="PWP428K" value="0x94" />
         <value caption="First 432K" name="PWP432K" value="0x93" />
         <value caption="First 436K" name="PWP436K" value="0x92" />
         <value caption="First 440K" name="PWP440K" value="0x91" />
         <value caption="First 444K" name="PWP444K" value="0x90" />
         <value caption="First 448K" name="PWP448K" value="0x8f" />
         <value caption="First 452K" name="PWP452K" value="0x8e" />
         <value caption="First 456K" name="PWP456K" value="0x8d" />
         <value caption="First 460K" name="PWP460K" value="0x8c" />
         <value caption="First 464K" name="PWP464K" value="0x8b" />
         <value caption="First 468K" name="PWP468K" value="0x8a" />
         <value caption="First 472K" name="PWP472K" value="0x89" />
         <value caption="First 476K" name="PWP476K" value="0x88" />
         <value caption="First 480K" name="PWP480K" value="0x87" />
         <value caption="First 484K" name="PWP484K" value="0x86" />
         <value caption="First 488K" name="PWP488K" value="0x85" />
         <value caption="First 492K" name="PWP492K" value="0x84" />
         <value caption="First 496K" name="PWP496K" value="0x83" />
         <value caption="First 500K" name="PWP500K" value="0x82" />
         <value caption="First 504K" name="PWP504K" value="0x81" />
         <value caption="First 508K" name="PWP508K" value="0x80" />
         <value caption="First 512K" name="PWP512K" value="0x7f" />
      </value-group>
      <value-group caption="Boot Flash Write-Protect bit" name="DEVCFG0__BWP">
         <value caption="Protection Enabled" name="ON" value="0x0" />
         <value caption="Protection Disabled" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Code-Protect bit" name="DEVCFG0__CP">
         <value caption="Protection Enabled" name="ON" value="0x0" />
         <value caption="Protection Disabled" name="OFF" value="0x1" />
      </value-group>
   </module>
